app/controllers/api/cats_controller.rb

INSERT INTO "cats" ("name", "description", "breed", "age", "weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "fluffy"], ["description", "awesome!"], ["breed", "human"], ["age", 33], ["weight", 1], ["created_at", "2019-09-12 00:47:58.021979"], ["updated_at", "2019-09-12 00:47:58.021979"]]
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 97], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "breed" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "2"], ["description", "2"], ["breed", "2"], ["updated_at", "2019-09-14 14:39:58.694511"], ["id", 98]]
---
    def update
        @cat = Cat.find(params[:id])
        if @cat.update(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 2]]
---
    def destroy
        @cat = Cat.find(params[:id])
        @cat.destroy